{
  "@context"=>"http://schema.org",
  "@type"=>"Recipe",
  "mainEntityOfPage"=>"https://www.allrecipes.com/recipe/16427/slow-cooker-italian-beef-for-sandwiches/",
  "name"=>"Slow Cooker Italian Beef for Sandwiches",
  "image"=>{
    "@type"=>"ImageObject",
    "url"=>"https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fstatic.onecms.io%2Fwp-content%2Fuploads%2Fsites%2F43%2F2020%2F09%2F11%2F178087.jpg",
    "width"=>960,
    "height"=>960
  },
  "datePublished"=>"2000-01-31T16:32:29.000Z",
  "description"=>"This Italian beef recipe makes a sandwich similar to one I used to get at a local restaurant when I lived in a suburb of Chicago. My all-time favorite! Serve on crusty rolls with roasted sweet or hot peppers, if desired.",
  "prepTime"=>"P0DT0H10M",
  "cookTime"=>"P0DT4H5M",
  "totalTime"=>"P0DT4H15M",
  "recipeIngredient"=>[
    "3 cups water",
    "1 (.7 ounce) package dry Italian-style salad dressing mix",
    "1 teaspoon dried oregano",
    "1 teaspoon dried basil",
    "1 teaspoon dried parsley",
    "1 teaspoon onion salt",
    "1 teaspoon garlic powder",
    "1 bay leaf",
    "1 teaspoon salt",
    "1 teaspoon ground black pepper",
    "1 (5 pound) rump roast"
  ],
  "recipeInstructions"=>[
    {
      "@type"=>"HowToStep",
      "text"=>"Combine water, salad dressing mix, oregano, basil, parsley, onion salt, garlic powder, bay leaf, salt, and black pepper in a saucepan. Stir well, and bring to a boil.\n"
    },
    {
      "@type"=>"HowToStep",
      "text"=>"Place rump roast in slow cooker; pour salad dressing mixture over the meat.\n"
    },
    {
      "@type"=>"HowToStep",
      "text"=>"Cover and cook on Low for 10 to 12 hours, or on High for 4 to 5 hours. When done, remove bay leaf, and shred meat with a fork.\n"
    }
  ],
  "recipeCategory"=>[
    "Slow Cooker Beef Main Dishes"
  ],
  "recipeCuisine"=>[],
  "author"=>[
    {
      "@type"=>"Person",
      "name"=>"MAUREENBURR"
    }
  ],
  "aggregateRating"=>{
    "@type"=>"AggregateRating",
    "ratingValue"=>4.63,
    "ratingCount"=>2643,
    "itemReviewed"=>"Slow Cooker Italian Beef for Sandwiches",
    "bestRating"=>"5",
    "worstRating"=>"1"
  },
  "nutrition"=>{
    "@type"=>"NutritionInformation",
    "calories"=>"318.2 calories",
    "carbohydrateContent"=>"1.6 g",
    "cholesterolContent"=>"100.4 mg",
    "fatContent"=>"15.8 g",
    "fiberContent"=>"0.2 g",
    "proteinContent"=>"39.4 g",
    "saturatedFatContent"=>"5.6 g",
    "servingSize"=>nil,
    "sodiumContent"=>"819.1 mg",
    "sugarContent"=>"1.1 g",
    "transFatContent"=>nil,
    "unsaturatedFatContent"=>nil
  },
  "review"=>[
    {
      "@type"=>"Review",
      "datePublished"=>"2004-06-21T15:48:40.300Z",
      "reviewBody"=>"Made these changes: omitted salt, substituted onion powder for onion salt, used 2 dressing mixes, added 1 1/2 tsp. dried onion, and added 2 beef bouillion cubes to the water.  Cooked on low for about 14 hours; shredded meat and refrigerated meat and juice separately overnight.  In the morning, I skimmed the fat off the juice, and returned the juice &amp; meat to the slow cooker, along with some chopped green pepper, on high to reheat for a couple hours. Served with horseradish and provolone cheese. Was a hit at our family reunion! Leftovers (if any!) reheat well for a quick lunch.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>4
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"LF",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2005-02-01T07:27:45.717Z",
      "reviewBody"=>"I moved from Chicago, and the thing I miss most is the food!  This is a great recipe for the Chicago food blues.  I, too, used the 2 pks of dressing mix (I even use the Italian dressing mix on this site), crushed red pepper, the juice (~1/8 c.) of some sweet and hot peppers, and sliced peppers and onions and serve it on warm Italian bread with mozzarella cheese (with the peppers and onions).  The best thing to do is to have it cook in the slow cooker until it is cooked through, then slice it thinly and return it to the juice for about an hour (just like they do at the beef restaurants).  It was a hit at my daughter's family birthday party, and took hardly any effort.  THANKS SO MUCH FOR THE RECIPE!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"(ME)",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2005-06-12T08:42:36.263Z",
      "reviewBody"=>"This recipe was good as is,but I now use it combined with 3 other recipes for french dip and it is great,I use all of the ingredients in this recipe except use only 2 cups of water and leave out both the salt and onion  salt,I add 2 cups onion sliced thin sauted in 1/4 cup butter ,1/2 cup soy sauce, 1 can coke[do not use diet or an off brand] 1 12 oz. can dark beer, 1 can beef broth, 1 can condesned french onion soup [campbells is best] I use the zesty soup mix. I try to get at least a 5 to 6 pound roast rump is o.k. if its choice otherwise I use a sirlion tip roast, this is much cheaper and less fat than a regular sirlion. I also add italian seasoning, basil, oregano,thyme,and white pepper. I slice the meat very thin like a french dip. update I have started leaving the water out and adding another can of low sodium beef broth.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"CODEACE",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2005-03-12T09:46:52.920Z",
      "reviewBody"=>"Made this for a casual supper last night and all who ate it said it was the best beef sanwich ever.  I followed advice of others and used 2 cups beef broth and one cup water; also two packages of Italian dressing mix.  My butcher suggested a chuck roast as it shreds more easily for sandwiches.  Slow cooked it and served with optional provolone cheese, thin-sliced red onion, mustard/mayo sauce and horseradish. Buy really good fresh rolls. Soooo yummy and sooo easy - THANKS!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"JBANDK9S",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2004-07-28T10:17:16.187Z",
      "reviewBody"=>"While the beef was moist and tender, there was way too much salt and pepper to make the broth suitable for dipping.  I ended up diluting it with about 2 cups of water.  Next time I'll eliminate the salt (canned broth is salty enough)and cut the ground pepper in half.  Otherwise, the Italian beef taste was definitely there and very good.  For the person in Phoenix, try Luke's at 16th Street and Indian School for their Italian beef.  It's the closest thing I've found to the real stuff.  A suggestion for another reviewer: If you want the beef sliced rather than shredded, make it the day before.  After a night in the fridge, slice it across the grain and gently warm it in the broth.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>4
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"KAET",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2004-07-24T14:41:59.653Z",
      "reviewBody"=>"This is fantastic! I've had so many people request this recipe. I'm really glad I found this recipe. I grew up in Chicago where you can order this anywhere you can buy pizza or a hot dog, but here in Phoenix no one has ever heard of it. It's my little taste of home. This is even better when you replace the water with chicken broth.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"APRIL4181",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2001-07-22T21:02:19.030Z",
      "reviewBody"=>"This is a great recipe!  Made sandwiches 'french-dip' style.  Will make again.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>4
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"GINNYG",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2005-02-21T08:09:16.310Z",
      "reviewBody"=>"I made this recipe using a venison roast and my family thought it was better than any they've ever had from a restuarant.  I took the advice of previous reviews and used 2 packages of dressing mix and 1 can of low sodium beef broth in place of the water.  I cooked the roast on high for 5 hours, shredded the meat with forks, then cooked an additional hour.  I toasted some big kaiser rolls and added provolone cheese to the sandwiches.  Definetely will make again.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Hollys Taylor Made Treats",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-02-18T16:37:59.050Z",
      "reviewBody"=>"I have nothing much to add to the already great reviews. Did all the common ideas ..omitted salt, used onion powder instead of onion salt, used beef broth (hence the no salt added),  used a 3.5 lb roast and same amount of everything else. It did smell and taste fantastic. Made it for Super Bowl. Perfect pick for that. The only thing I must add... is 17 y.o. daughter walked through the kitchen at 11 am, jerked her right thumb at the kitchen counter (crockpot) and says \"Whatever is in that thing smells really good and I just might taste some\". And unfortunately, that for me, is the highest praise I'll ever get. Oh and btw, she actually ate it. Really good. Love, Mom",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"lisa j",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-03-10T15:59:38.867Z",
      "reviewBody"=>"Instead of water, I used two cans Campbell's beef broth--I wanted more flavor than water would have given it plus I'm cleaning out my pantry. I also eliminated the salt and I made my own dry italian-style salad dressing mix. Before adding the roast, I layered the bottom of my crockpot with sliced onions and minced garlic and I braised my roast. I used thick rolls that I slathered with garlic butter and threw under the broiler slightly before piling on the meat and provolone cheese and putting it under the broiler again. This was good but we all agreed that we like the italian beef with the peppers a little more. LOTS of spice and flavor which we all thought was quite tasty--the two grownups just missed the peppers.  I appreciate this recipe because when you have a piece of beef that's been sitting in the freezer, it can be quite tough if you don't slow cook it. This not only helped me make quick work out of dinner, it saved my meat so I could use it afterall.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>4
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Sarah Jo",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2006-12-24T15:10:09.597Z",
      "reviewBody"=>"The first time I made this it came out tough but the problem was my slow cooker cooks in increments of 4, 6, 8, &amp; 10 hours and I was in a hurry and cooked at 8 hours so the meat was tough and hard to pull. I have perfected my technique and now I have to say that this is a 5* recipe and actually better than some Chicago places. \nI was born and raised in Chicago (Near North side, NOT the suburbs) and know Italian beef sandwiches. These are better. \n1. I use only beef broth instead of water.\n2. I use extra Italian dsg than what it calls for. Double\n3. I add lots of sliced green peppers about an hour before the 10 hours are up.\n4. I shredd the beef and put it back into the cooker with its juices and peppers and let it soak for a half hour at least. Stirring on occasion.\n5. Serve with fresh french bread.\n6. I start this a 8am and by 7pm we have a fantastic dinner.\n\nMy entire family and friends love these sandwiches and we are all Chicagoans. This is an awesome easy recipe to make for when you have many visitors. *****",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Allrecipes Member",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2006-12-26T13:05:38.033Z",
      "reviewBody"=>"We loved this recipe. I used 2 pkgs of italian dressing, 2 cans low sodium beef broth, and left out the bay leaf. I cooked the meat on low for 10 hours in the crockpot. I then shredded the meat with a fork and placed it back into the crockpot to let meat soak up the juices. My husband and I put garlic butter on the rolls and placed them in the oven at 450 for 10 minutes. Then sauted peppers and onions in olive oil to put on the sandwiches. The order of our sandwiches was: roll, meat, peppers &amp; onions, and cheese. We placed our sandwiches in the oven at 450 until cheese melted. Thanks for this recipe, it was wonderful!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"LZWEEN",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2012-09-04T11:26:09.917Z",
      "reviewBody"=>"I'm gonna commit a cardinal sin &amp; give a (5-star) review even though I made a few changes...Used a 5lb. chuck roast, 2 tablespoons Italian seasoning (just a shortcut, same herbs), &amp; instead of water I used a can each of condensed french onion soup, consomee &amp; beef broth. Added the 1 packet of dressing mix &amp; a small can of pickled carrots w/ jalapeno. After the beef was oh so tender I shredded it &amp; returned it to the crock pot. Made the sammies by pulling the meat right from the juices &amp; served with sauteed onions, garlic &amp; peppers on french rolls w/ melted provolone cheese. It was the recipe that gave me the idea &amp; the blend of seasoning was delish. I just believe that the beef broths added a depth (if you will) &amp; richness that would be lacking, &amp; I really liked the bit of tang from the pickled carrots/jalapenos. Yum yum great - thoroghly enjoyed by all!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"BudsGurls",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2006-03-06T21:09:18.140Z",
      "reviewBody"=>"Oh boy have I stumbled on something.  I did substitute more beef broth (2 cups) and added a 2nd seasoning packet of Italian as recommended.  When ready to serve, place meat on an open faced piece of bread (hoagie style), then add a few sliced up peppercini's.  On top of that, I added swiss on some, provolone on others.  Stuck them in a 400 oven for 5-10 minutes to melt the cheese and crisp up the bread.  Wow was that a great way to serve these.  I used the reserve juice and served it au jus style.  Got such good compliments and it dressed it up enough for company at an Oscar party!!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Krista Ferrill Donahue",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-04-03T04:54:19.790Z",
      "reviewBody"=>"Not very impressive, I used beef broth and two packets of Italian and it was still kind of bland!  It was too expensive to make for the result we got.  so disappointed",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>2
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Marisa",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-03-20T12:40:42.213",
      "reviewBody"=>"Great recipe although I did make a few changes.  I used  2 cups of beef broth in place of the water, double all the herbs and salad dressing and cooked on low (makes it so much more tender) also once shredded I returned the beef for a further hour of cooking.  added 2 seeded Jalapenos for a little extra bite.  Great recipe, its my families favorite and I make this time and again.  You really could not find a quicker, simpler, tastier dish...",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"TheBritishBaker",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2002-09-09T13:44:47.077Z",
      "reviewBody"=>"After trying this recipe, you may just think twice about ordering Italian Beef sandwiches from a fast food restaurant. I recommend using grass fed beef obtained right from the farmer (if you have access to a Farmer's Market or know a good meat guy). This beef is by far beefier tasting than than factory farmed grocery store beef.\nI use extra pepper and garlic in the gravy and add several handfuls of sliced bell peppers (assorted colors) and onions around the roast before pouring the gravy in. Also using low sodium *good* beef stock/broth makes for an even more flavorful gravy than using water. The addition of peppers and onions makes this recipe THE BOMB!!!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Donna Faerber",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2007-10-18T08:14:01.323Z",
      "reviewBody"=>"This is one of the best meals I've made lately! The beef turned out sooo tender and juicy and the flavor was outstanding.\n\nBased on other reviews the changes I made were to substitue beef broth for the water and I used 2 pkgs of Italian dressing mix instead of one. I cooked it for 8 or 9 hours, shredded it, then put it back in the juices for another 1-1/2 hours.\n\nI served it on hoagie rolls with swiss &amp; provolone cheese and toasted it under the broiler. Then we topped it off with sauteed mushrooms, peppers and onion. This is a definite keeper and received raves from the guys.\n\nA tip- if there's any leftovers (I'll always make extra just to be sure!) Try using this beef to make the \"Shredded Beef Enchiladas by Christy\" from this site. That makes another *awesome* meal.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"FAEANNE",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-02-28T07:27:23.710Z",
      "reviewBody"=>"Big hit at the firehouse. Use Zesty Italian-style dressing mix. Also, use beef stock instead of water. Add a small bit of red pepper flakes for a little extra depth.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"tumeoca",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2012-06-13T09:38:07.540Z",
      "reviewBody"=>"I am originally from Chicago and have been dying for REAL Chicago grub.  Though it's not the thinly sliced beef that I am used to from up north it tastes just the same!  It is a great dish and my wife and I make it now almost monthly!  Only suggestion is to premix all the dry ingredients together the night before.  That way, in the morning before you head off to work, you drop in the roast, sprinkle the dry over it and pour over the water.  Fire up the slow cooker and just wait for the end of the day for a hot sandwich of nostalgia.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Chris Mosley",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2010-11-06T15:07:22.857Z",
      "reviewBody"=>"Excellent recipe!  Aside from being extremely easy and flavorful, we were able to use the leftovers for several other meals.  Day 1 we made sandwiches and Day 2 we pan fried some of the left overs and used it on tacos.  My husband ate his tacos on corn tortillas with the beef, onion, and cilantro while I added refried beans and cheese.  Both were excellent.  Day 3 I made a lazy version of beef stroganoff with the meat thrown in.  Great easy recipe.  We'll make this again.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"AuntieHeather",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-11-11T10:58:21.473Z",
      "reviewBody"=>"My boyfriend and I thought this was awesome.  I cannot comment on if it tastes like italian beef because I have never had it, but it was really great as a sandwich.  I know everyone has their own personal tastes, but I have read several reviews that say this is bland even when they use the beef broth and the extra seasoning packet.  I may have a suggestion on how to make the meat more flavorful.  Each time I have made this, I always cook it overnight for about 8 hours, then shred it when I wake up, put it in the fridge before I leave for work, and then warm it back up when I get home.  I know that kind of takes away from the convenience of having something ready and hot when you get home, but I can almost guarentee this will not be \"lacking flavor\" if this is done.  Maybe the meat just needs to marinate in its shredded form to get the flavor into the meat.  Just a suggestion.  Very tasty, thank you for sharing.  We like ours with provolone cheese, jalepenos, and banana peppers.  Sometimes I will saute onions and green peppers... lots of toppings you can use for this!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Deb0430",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2010-11-18T16:32:59.713Z",
      "reviewBody"=>"Absolute best Chicago Italian Beef clone that I have tried.  I was born and raised in the Chicago area and now reside on the east coast (waa waa).  I miss Italian Beef Sandwiches!!!  This recipe is the closest.  Get your self some hot gardinera peppers and have at it.  A little bit of Chicago right in your own home.  Or top off your sandwich with mozzarella cheese and you have a chief.  Nice this is da best!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Maryse Ownie-Crilly Kloss",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-09-25T12:41:51.417Z",
      "reviewBody"=>"Ok, I'm from Chicago. While this is not true Italian Beef sandwich it's close enough. I doubled all the spices and marinated overnight. Browned on stovetop then Cooked on low for about 7-8 hours took out of juice and shredded then returned to crock for about half an hour. I served on warmed hoagie rolls with hot peppers. Just smelling it cook brought back memories. Try it..",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Mary J",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2010-11-23T08:59:13.740Z",
      "reviewBody"=>"This was fantastic! I did follow alot of reviews and doubled up on the spices and packets of italian dressing. I added 24 oz of beef broth instead of water and only 2 1/2 lbs of beef roast. I added strips of a green pepper to the last 4 hours of cooking but wished I had added more. Will make again!!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Elizabeth Blair Henry",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2006-10-26T12:23:02.653Z",
      "reviewBody"=>"We own a catering company and have put these sandwiches on our \"specials\" menu for the second time.....an absolute customer favorite! Everyone loves them. We follow the recipe almost exact, add a little red wine in place of some of the water. serve them with a condiment tray of sliced cheeses, onions, peppers, tomatoes &amp; lettuce, horsy sauce, mayo and dijon mustard.....I have received more raves on this menu item than any other!!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"MOONBEAM2829",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2006-11-30T10:53:36.093Z",
      "reviewBody"=>"It was excellent but instead of a crockpot, I used a roasting pan. I heated some olive oil, rubbed the meat with salt and pepper seared the meat in the hot oil and then browned 2 large onions in the same pan then poured the seasoning over the meat and covered in foil. I cooked it for 2 1/2 - 3 hours then shredded and stirred in all of the juices and onions together.  Delicious. My family could not wait; they ate it straight out of the pan",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"tamara",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2010-11-28T23:35:52.190Z",
      "reviewBody"=>"I did everything just as the recipe called for it. The house smelled wonderful! And just before it was ready I sliced up some mushrooms, onions, and peppers and threw them in a skillet until they were cooked through and limp. Meanwhile I stuck our Hoagie rolls in the oven at 300 degrees wrapped in foil to let them soften. Once rolls were done, I placed shredded meat on a cookie sheet topped with pepper mixture and layed provolone slices over it and broiled til cheese melted. Put mayo on hoagies and put meat with goodies on the rolls and it was WONDERFUL! Sister in law just had a baby and took over some for her and hubby too! Loved it!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Manda Steffler",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-07-28T12:16:25.460Z",
      "reviewBody"=>"This recipe is fantastic!!!  I agree with \"MomSavedByGrace\"'s comments: use 2 packets of Italian dressing instead of 1, use beef broth instead of water, and take the meat out early, shred it, and put it back in the juices.  I also prepared our sandwiches the same as hers and everyone loved it.  My daughter doesn't like any kind of meat, and neither of my kids like sandwiches, and they asked for this every day until it was gone.  Very good!!!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"LovesToCook",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-06-21T22:12:05.307Z",
      "reviewBody"=>"AWESOME! \nVery easy to put together and has an outstanding flavor! SO tender &amp; juice! I followed the recipe to a T. I really think that the reviews that stated it was too salty, must be also be the ones who used beef or chicken broth instead of water as called for - broth has a very high sodium content. I thought it was perfect as written!\nThank You!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"BABBYLEE",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-03-07T12:17:45.983Z",
      "reviewBody"=>"Very nice! This makes enough to serve a crowd or to serve you, over and over. Next time, I'll throw in some beef broth and maybe a touch of red wine. I'll also bag it in quart-sized freezer bags and store them in the freezer so they can be used for a quick lunch or supper.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Cat Osbourne",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2009-09-28T17:09:33.820Z",
      "reviewBody"=>"This was so good!  I suggest using a chuck roast if you want to shred your meat.  If you have a meat slicer then go with the rump - otherwise don't bother with that cut because it doesn't shread as well and Italian beef needs to be sliced thin! (shredded is next best option IMO)  I used 2 packets of the Italian dressing mix and I used one can of beef broth and then added water to it to make 3 cups total.  Served on french rolls (with lots of the juices) with sliced provelone and giardinera.  Reminded me of growing up in Chicago!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Cara McGuire",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2012-07-07T09:33:14.400Z",
      "reviewBody"=>"Love this!  I did; however, tweak it to what I have read.  Replaced beef broth for water, used chuck roast, doubled the salad dressing mix.  Served on toasted hoagie rolls, and topped with extra sharp provolone cheese.  I throw this together in the morning and when I come in the door after work the smells are amazing (plus so easy).",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"tsend",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-06-21T22:12:05.307Z",
      "reviewBody"=>"AWESOME! \nVery easy to put together and has an outstanding flavor! SO tender &amp; juice! I followed the recipe to a T. I really think that the reviews that stated it was too salty, must be also be the ones who used beef or chicken broth instead of water as called for - broth has a very high sodium content. I thought it was perfect as written!\nThank You!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Suzie",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2010-11-26T21:56:14.520Z",
      "reviewBody"=>"THis is a hit every time I make it.  I don't have to change a thing.  I get crusty Italian sandwich rolls, split them, lay them open on a baking sheet.  Cover one half with some of the cooked beef, cover the whole thing with slices of mozzarella cheese and pop in 425 oven until cheese is melted and the bread is toasty.   Close the sandwich and enjoy!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Phyllis",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-09-10T07:51:40.847Z",
      "reviewBody"=>"I used low sodium beef broth instead of water, omitted the teaspoon of salt because I could always add it later, used the Zesty Italian dressing mix and didn't bother to boil the spices, just didn't see the need as it was going to cook all day any way.  We really enjoyed this.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>4
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Wilemon",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-01-23T16:49:52.037Z",
      "reviewBody"=>"Made this recipe for a family party and it turned out great.  Used beef broth in place of water.  I also cooked the beef two days ahead and shredded it, saved some of the broth and then reheated it the day of the party with the broth.  Yummy!!  Thanks for sharing",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"DeniseY",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2005-12-16T22:30:50.700Z",
      "reviewBody"=>"GREAT recipe!  I took a couple suggestions from other reviews.  I had a 2 pound roast, but I used the measurements for a 5 pound roast.  I substituted a can of beef broth (1 1/2 cups) and added only 1 1/2 cups of water.  Which totaled the 3 cups of liquid required with the recipe.  I added two packets of Italian style dressing mix.  I did not add the salt.  I cooked the roast in the crockpot on high for 3 hours.  Then I cut the roast into large chunks and cooked for another 1 hour.  I then took the roast out and shredded it.  I put the shredded roast back into the crockpot and cooked for another 30 minutes to get the flavoring throughout the roast.  We had this on Gonnella French Italian Rolls.  It tasted WONDERFUL.  It also has a great smell that filled through the house as it was cooking.  My husband also enjoyed this recipe and thought that it was delicious.  Thank you for this great recipe!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Angela",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-01-04T12:09:58.750Z",
      "reviewBody"=>"This was awesome. I made this as a quick meal for Christmas Eve since we were going to be on the run. I bought a 3 pound piece of meat and cut it in half (froze the remaining half for later) since I was only making this for the two of us. It was really good. We used hoagie buns and I bought provelone cheese and broiled it on top of the sandwiches before serving. I also used some of the cooking juices as an au jus. My husband loved it.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"micki1980",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2005-12-04T17:53:54.730Z",
      "reviewBody"=>"This recipe is delicious! We used chuck roast because it was on sale and added two beef boullion cubes to the water. We seared the roast before we put it in the crock pot.  We served it with sauteed onions &amp; green peppers on fresh hoagie rolls from the famous Mancini's Bakery in Pittsburgh.  Sargento makes a Bistro flavor of Mozzarella &amp; Asiago with roasted garlic cheese that was fabulous.  The beef was great by itself and the combination of everything made for a hot, satisfying meal. A definite keeper!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Claire",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2012-11-23T11:04:08.460Z",
      "reviewBody"=>"We loved this one!  I used a 2.5 lb. chuck roast.  I used broth instead of water.  I halved the broth and seasonings, but used a full packet of dry Italian salad dressing mix.  I was tempted to brown this off first and deglaze my skillet with the broth, scraping up the browned bits, but decided against it and it was just fine without the browning.  I cooked mine on low for just about 8 - 8 ½ hours and it was perfectly moist and tender and shredded beautifully.  I put the shredded meat on toasted mini sub buns, added provolone and broiled just until it was nicely melted.  I strained the broth and served it with the sandwiches as an au jus dipping sauce.  Everyone loved it.  I got six good-sized sandwiches out of my 2.5 lb. roast.  Really yummy!  In fact I could go for another one right about now!  UPDATE 2/2/14 - I made this again using a 3 lb. chuck roast.  Made as before using beef broth again (one can) and halved the seasonings, subbing onion powder for the onion salt.  Note to self:  Use the onion salt next time.  This 3 lb. roast was done in 6 1/2 hours set on low in my new crock pot.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"bellepepper",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2014-03-07T08:21:32.270Z",
      "reviewBody"=>"Italian beef came out great!  Made the recipe as directed except didn't have the bay leaf and added diced onion instead of the onion salt.  Would recommend cooking on low for the longer time, as I cooked it on high for 5 hours and shredded a little tough.  Another 2 hours on low in the croc and the shredded meat softened up wonderfully and it was a hit at the party.  The only must have is a jar of  Giardiniera, no Chicago Beef is complete without!!!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Bill Weaver",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2012-12-31T10:36:28.383Z",
      "reviewBody"=>"We fell onto this beefy goodness like a pair of mountain lions! My boyfriend has already told me three times in the last 30 minutes that he LOVED this and it's a keeper. I'm chewing on my second sandwich as I type this! This is great recipe for so many occasions: busy weeknights, tailgates or parties... and it can stretch if you make it on little slider buns as an appetizer. I only did a few things differently. I used low sodium beef broth instead of water. I used a 4.7 lb. bottom round roast which was the best \"economic\" choice and looked less fatty. The fat it did have was on the outside of the cut. I removed most of the thicker fat before putting it in the cooker. I did not use the table salt, just the onion salt. And I added a generous tablespoon of dried onion flakes. Everything else was just as listed. I served it on toasted hoagie buns with yellow banana peppers, sauteed mushrooms and provolone. As others mentioned, I generously drizzled the broth onto the bun; there was plenty of liquid so I think you could use it in a small bowl a la \"french dip\", too. This also freezes well mixed in with the jus so I plan to enjoy this a couple more times in the coming months!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Jill Schultz",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-04-13T13:01:46.463Z",
      "reviewBody"=>"Fantastic! I was looking to make something that would take me and my hubby back to our last trip to Chicago, where we ate at Al's Beef after seeing it on Man Vs Food. This fit the bill and a 2.5 lb roast made three nights worth of the most delicious Italian Beef sandwiches. Especially delicious when eaten on Rotella's hoagies and dipped in the juices (I did use beef broth instead of just water.)",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Mindy Vogl",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2004-07-19T13:09:39.373Z",
      "reviewBody"=>"Oh my gosh, this is awesome! I made this recipe in an \"emergency\" when I needed an entree for a casual gathering. The flavor on this was WONDERFUL and everybody there had at least second helpings. It disappeared! (I took the advice of others here and used beef broth instead of water and doubled the salad dressing mix.)",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"TROOPDOOP",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-04-03T17:09:42.303Z",
      "reviewBody"=>"Wow!  I've been searching for recipes that bring that restaurant flavor to my table.  I will search no more.  Hands down, this is the best shredded beef recipe I have tried.  I can't stop eating it!  As previous reviewers suggested, I used chicken broth rather than water.  I omitted the salt because of the broth.  \n\nI served this on toasted buns and the result was fantastic!  I would give it more stars if I could!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"ironchefwannaB",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2014-02-03T11:56:41.990Z",
      "reviewBody"=>"This was really good. I used a chuck roast all the same seasoning and 1 1/2 pkgs of the dry salad dressing. So simple and so good. I also used 32ounces of beef broth for a 4 lb roast. Came out great!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"cookinama",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2002-10-15T16:07:15.467Z",
      "reviewBody"=>"My husband grew up in Chicago and his mother would make these sandwiches all the time for him.  When I made this recipe, he never wanted me to go back to his mothers.  This is the best beef sandwiches we've ever had!  I have made this particular recipe many many times.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Dixie J",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2002-09-13T07:16:59.547Z",
      "reviewBody"=>"One of the best sandwiches ever! It's so easy, you can hardly believe the results.  I added sliced onions and mushrooms to the recipe and topped the sandwiches with mozzarella cheese on hard rolls.  These were so tasty, I'm going to make them for our next big family gathering.  Thanks for a wonderful recipe.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"ANNHE50",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-02-19T08:32:41.493Z",
      "reviewBody"=>"My sweetie made this for a tailgating party.  It was exceptional!  This is something we will make again...and again...and maybe again...and again.  :)",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"HisAnomaly",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2003-01-18T06:57:52.043Z",
      "reviewBody"=>"No wonder this is a 5-star recipe!  Absolutely delicious, make a tough rump roast taste like $10.00 a pound roast beef.  I doubled the italian seasoning mix and used beef broth instead of water, and it was so delicious that my husband wanted sandwiches two nights in a row.  This from a man who doesn't do leftovers!  Makes great hash, too!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Paula Kelsay McFarland",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-03-16T00:52:17.480Z",
      "reviewBody"=>"I didn't know whether to give 1 star for disappointment or 5 for taste so I went with the middle and gave it 3, here is why: I followed the recipe exactly, and all day my family kept asking if I was making a roast with carrots and potatoes, I realized they were right, that is exactly what the house smelled like. Well I shredded the roast after approx 10 hours, sauteed some onion and mushroom on the stove, and toasted the sub rolls under the broiler with some 6 cheese Italian cheese. It was good, but we all agreed that it just tasted like the leftovers we have a couple times a month when I make a roast. I always make gravy from the drippings when I do a roast and potatoes in the crock, then I shred the leftover roast and put it all in the fridge for hot roast beef sandwiches the next day. So all the left over shredded beef and broth leftovers from this recipe are in the fridge for hot roast beef sandwiches tomorrow.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>3
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"missability",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2010-12-07T07:47:49.823Z",
      "reviewBody"=>"This was awesome!!!! Next time I have a football party, I am going to serve these with home made fries and a fixins bar with sauteed onion mushrooms, green peppers, hots... The herb flavors blend so well with the beef and it is very tender. This was a huge hit!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"J",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2014-02-23T19:27:13.000Z",
      "reviewBody"=>"2/23/14 good. in crock on low 6 hours and high 2 1/2 hours",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>4
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Kathy Cochran",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-03-14T20:11:15.663Z",
      "reviewBody"=>"I'm always looking for new crockpot ideas, and this one is different.  The only change I made and it was after the meat had been cooked, was I felt it needed a bit more seasoning so I added one more package of Italian dressing mix to the liquid. I also toasted the french rolls and then melted some Jack cheese on the botton slice under the broiler. That also helps to prevent a soggy bun. Pretty tasty!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"brulee",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2004-02-08T10:46:16.733Z",
      "reviewBody"=>"My guests loved this recipe, but all of them asked for onions to go with it.  After trying a variety, I found that for this recipe, people prefer red onions sauteed over medium heat, until they are really really soft.  A medium red onion makes enough for about 5 adult servings.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"AlliePeacock",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2008-04-09T09:23:11.793Z",
      "reviewBody"=>"This is a spectacular recipe!  I used sirloin tip roast and it was all lean. Also took previous advice and used 2 pkgs. of dressing mix and beef broth in place of water.  Served on toasted French rolls with melted provolone ... you can impress company with this one!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"CHER",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-04-04T16:32:59.140Z",
      "reviewBody"=>"Loved this recipe.. so easy to make.  I took the suggestions of using (2 1/2 Ilbs)chuck roast instead of the rump roast, used Beef broth instead of water and omitted the salt and also used 2 pkgs of Italian-style salad dressing mix.  Then put sandwiches under the broiler topped with  pepperoncini and  topped with provolone cheese. Yum. Next time might try toasting hoagies first with garlic butter.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Mickey52",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-06-18T04:29:34.340Z",
      "reviewBody"=>"I can't give this recipe enough stars.  It is so easy to put together and then go through your day without any worries.  The end results are beyond delicious.  I use chuck roast because of saving $$$.  I also use twice as much Italian seasoning as called for.  Serve this sandwich with Provolone cheese, grilled onions and banana peppers and it is a feast.  My family loves this sandwich.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Sicilian",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-09-04T17:13:38.867Z",
      "reviewBody"=>"Instead of salt and onion salt, I used an onion soup packet. I had about a 2.5lb chuck roast, but kept all of the seasoning amounts the same. I asked my bf how many stars...he said 6.  He definitely enjoyed it!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Amy",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2009-03-17T09:06:08.433Z",
      "reviewBody"=>"I made so many changes maybe I shouldn't rate this recipe?? Although they are the same changes most people seem to have made. I used beef broth instead of water, doubled the dressing, omitted the salt and used onion powder instead of onion salt.   It was very very yummy.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>4
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"PrincessJenna",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2010-06-16T10:41:20.093Z",
      "reviewBody"=>"I use chuck roast istead of rump roast it turned out delicious.  This will be in our regular rotation from now on!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"ChristineD",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-03-23T06:11:39.633Z",
      "reviewBody"=>"This is an amazing recipe.  I made it twice in one week, and I live alone!  Following suggestions by others, I used a 32oz container of beef broth, 2 packets of Zesty Italian dressing, and Italian seasoning in  place of individual herbs. I DID NOT add salt. Next time, which may be today, I'm going to rub fresh garlic over chuck roast and let it sit for a day before cooking.  I served it on crusty rolls, which I broiled topped with either dill pickle chips or peproncini and provolone cheese.  This will definitely be my go-to party dish.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Patty Ann",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2010-07-26T15:12:56.930Z",
      "reviewBody"=>"used beef broth and added two packets of dressing and omitted any extra salt.  Also used fresh garlic.   like others have said, it was awesome on toasted rolls with provolone.  Cooked in crock pot about 5 hours on high for 4 lb meat.  just keep checking it towards the end to see how easy it shreds.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Sue",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2000-08-05T16:45:15.423Z",
      "reviewBody"=>"A great recipe, made me feel like I was back in Chicago. I substituted in a fresh onion, ,a sliced green pepper, and added a couple extra bay leaves and had good results.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Allrecipes Member",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2014-08-12T19:10:30.290Z",
      "reviewBody"=>"FANTASTIC!  ...and oh man, the aroma is mouth-watering!  Made this for my father for Father's Day, he proclaimed this one of the best ever sandwiches! I did use most of the suggestions by the reviewer 'MomSavedbyGrace'. The end result was a moist Italian Beef that tasted restaurant gourmet!  Thank you, thank you =)",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"ARK_AMY",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2013-04-20T16:55:25.960Z",
      "reviewBody"=>"This is a great recipe but can be done cheaper and easier.  Season a good marblized chuck roast with garlic salt. Season with dry Italian dressing,shake several shots of worchestershire over meat and pour 1 can of beer and and equal amount of water over all. Cook in slow oven or slow cooker.  Great for parties or pot lucks.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>3
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Lucy",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2009-10-28T03:44:59.447Z",
      "reviewBody"=>"ok, a little salty for me",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>4
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Kim Snyder",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2013-06-16T04:04:36.170Z",
      "reviewBody"=>"You know, I absolutely love the Italian beef sandwiches you get in Chicago. This was just OK. I wasn't crazy about it. The texture of the meat was a bit spongey and tasted a little bland. I don't think you can get the same melt in your mouth texture and deep flavor results in a crockpot that Chicago Italian beef places get in their ovens. It's also hard to duplicate the flavor of the giardiniera and find the right kind of bread. I think this is just one of those things you have to go to Chicago for.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>3
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Nan",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2014-09-03T16:09:59.677Z",
      "reviewBody"=>"This recipe was fantastic!  I cooked a roast this way, I did use beef broth in place of the water, after 12 hours took out the meat and shredded it, (put in fridge for the night) then put another roast in the same juices and cooked for 12 hours again.  Shredded it when done and combined the two, then I took out a bunch of fat from liquid and discarded then poured all the liquid over the shredded meat in crock pot.  Served on hoagie buns with sautéed onions and peppers and melted cheese.  DELISH",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Lisa Bergin Rollin",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2006-08-04T16:38:00.763Z",
      "reviewBody"=>"Absolutely delicious!  I live in Chicago and can't believe how close this comes to a real Chicago beef sandwich. I added the 2 pkgs. of dressing and beef broth as suggested. Thank you so much!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Lori McClaughry Marek",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-06-21T19:36:40.480Z",
      "reviewBody"=>"I made this for dinner today, and all we can say is WOW! We're Chicagoans, born and raised, and still live there, and this was nearly as good as any Italian beef we've had. I used a 2 lb rump roast, and the night before, I prepared the Italian dressing/broth mixture to allow the flavors to meld overnight. I used beef broth in place of water, the same amounts for the spices, even though it was a smaller roast. I used plain onion powder in place of onion salt, figuring the broth added some additional sodium. I think if one was using a 5lb roast, they should double the spices for the fullest flavor. \r\n\r\nI put the roast in my crock pot, poured the broth mixture over and set it to low. After 9 hours, I used 2 forks and shredded the beef, and then added the following sliced peppers to the pot: 1 green bell, 1 red bell, 1 sweet cubanelle and 1 Italian sweet red Ancien pepper. I re-covered the pot, then headed for the gym. When I returned, I checked the peppers and they were perfect! I had some whole wheat French bread rolls (cause we're healthy that way) that I warmed in the oven, and then filled them with yummy, tender, flavorful beef. I ladled a bit of the liquid onto the beef and bread to soften it, and then added some of the peppers. To mine, I also added some hot giardinera, because I like it spicy. My husband's reaction after the first bite was \"Mmmmmm! Oh, that's  good!\"",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"ronniecaliente",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-03-27T16:48:31.407Z",
      "reviewBody"=>"Very good.  I did not have any dry Italian seasoning mix, so I did not add it to the meat.  I kept everything else the same.  When it came time to serve, I halved a French loaf, spread some butter on it and placed it under the broiler to toast.  I sauted some onions in butter and placed the meat, onions and sliced provolone cheese on the sandwich to creat a sort of philly steak and cheese.  It was good!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Cheoah",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2003-05-22T13:26:27.293Z",
      "reviewBody"=>"I have already made this 3 times and we love it.  The first time I made it, I made it like the recipe but used beef broth instead of water.\r\n\r\nThe second time I used a meat seasoning spice packet (Old West Pepper Steak) that I purchased online instead of the recipe spices and that was really terrific!\r\n\r\nThe third time I made as per the recipe again, but doubled the salad dressing packets and again used beef broth (but more, because we love it juicy).\r\n\r\nI am making it again next week with a different seasoning packet.\r\n\r\nThis recipe is so flexible, you can make it with your favorite spices.  It also makes the best leftovers!\r\n\r\n",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"GROOVYFISH",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2014-03-07T19:24:26.153Z",
      "reviewBody"=>"I thought this was too salty. BUT, it seemed to balance out once in a sandwich. I was pleasantly surprised. Hubby loved it, so I guess I'll definitely be making this again!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>4
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"JemmasSong",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2010-10-22T18:39:19.613Z",
      "reviewBody"=>"SOOOOO GOOOOOD! My boyfriend talked about how much he loved this for an entire hour! I only had 2.5  lbs of pot roast so that's what I used and it turned out great. I kept all of the same ingredient amounts except added 2 packets of the Italian dressing mix and one can of beef broth plus about a cup and 1/2 of water. I cooked on high for 4 hours, removed roast, shredded, removed fat, then put it back in pot on low for an additional 30 minutes, along with green peppers, red peppers, and some onion. I dipped the middle of each bun into the broth from the pot and broiled for a few minutes to make crispy and tastier. When all was done put it on the buns and served with a pickle. My boyfriend ate 3 and 1/2! And my picky 5 year old eater couldn't get enough either. Sooooo delicious, he will be forcing me to make this again and again:) Thanks so much!!!!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Rayneita",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2014-02-23T13:03:13.820Z",
      "reviewBody"=>"Yummy! Used the leftovers to make an awesome stroganoff!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Kinsey Livingston Valdivia",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2003-07-01T21:06:52.630Z",
      "reviewBody"=>"This Italian Beef is absolutely awesome! I used two 0.7 oz. packages of the dry Italian dressing mix and used canned beef broth in place of the water. The flavor was just right! My boyfriend liked it so well, he may just marry me yet!!!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"JODEE",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-03-01T17:39:18.410Z",
      "reviewBody"=>"Very tasty.  Made the recipe exactly as written.  I used a rump roast as per the recipe, but i am not a fan.  Next time I will use a chuck roast.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>4
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Tedders",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-04-04T14:28:36.700Z",
      "reviewBody"=>"This was really really good, but if you're going to use a 5 lb roast, I suggest you double all the other ingredients.  I used beef broth instead of water and omitted the salt.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>4
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"RALWATTAR",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2014-02-11T17:47:07.723Z",
      "reviewBody"=>"My family loved this so much they requested I make it again next week.  My teenage sin was drinking the juices from it!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Staci Noble Cook",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2013-12-28T04:01:42.040Z",
      "reviewBody"=>"I've made this twice and it couldn't be easier. Even people who aren't typically red meat eaters enjoyed it. I used a 5-lb chuck roast, an entire 32-oz carton of beef broth instead of the water, and two packets of dressing mix. I cooked 10 hours on low before shredding, and put the meat back in the broth for another 90 minutes. We melted sharp provolone on one side of long rolls in the oven, and spread some diced hot cherry peppers on the other side. Really good! Thinking of trying this recipe with pork and chicken broth...",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"jenzy",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2014-01-30T06:17:03.213Z",
      "reviewBody"=>"I and my whole family love this one. It has become my traditional meal for Christmas Dinner. It's easy and smells Wonderful. I usually do 6lbs. of roast and double the liquid and spices. Also I slice the roasts into large chunks to start. When almost done I place sliced green peppers on top and let them cook in the juices. When done I take slices out and place in small crockpot. Cheddar cheese sauce is a favorite to top off the sandwich.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Steven White",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-03-12T17:09:44.193Z",
      "reviewBody"=>"I have made this for years, but I use nothing but water and three packages of dry Italian salad dressing mix!  It's much easier and most of the dry ingredients that the original poster added are in the dressing mix.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"TeacherSue",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2014-02-05T19:04:01.727Z",
      "reviewBody"=>"We used a chuck roast instead of a rump, but otherwise followed the recipe exactly.  These were a huge hit at our Super Bowl party.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Mark  Amanda",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-03-13T10:01:04.620Z",
      "reviewBody"=>"I made this for Sunday dinner today and my family raved about it! I followed other reviewers suggestions and used beef stock (2 cups) but I also added 1 cup of red wine (Merlot) and it was fabulous. I also left off the salt. Even though my stock was homemade and wasn't salty, we still didn't miss the salt. I only had 1 packet of Italian dressing mix (Good Seasons Garlic &amp; Herb), so I added all the other seasonings - but used less pepper and onion powder instead of onion salt. This is definitely a keeper! Thanks for a great recipe.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"malbanese",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2000-08-29T18:59:04.657Z",
      "reviewBody"=>"I loved it. My husband loved it. I Fried up some green peppers &amp; onions to put on top &amp; added mozzarella &amp; fresh parmesan to the sandwhich. Then served it with french fries.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Allrecipes Member",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2013-04-02T11:09:01.060Z",
      "reviewBody"=>"I have a love/hate relationship with my crock pot. I love how easy it is, but I hate how it makes every single beef dish I cook taste like stew (bleck - not a fan of stew). This is the first beef dish I have ever cooked in my crock pot that doesn't taste like stew. Woo hoo! I followed the directions as written, and it's delicious. Thank you!!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Eileen Lee",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2010-02-15T11:42:33.280Z",
      "reviewBody"=>"This was my first attempt using this recipe &amp; as such I am treating it as a baseline for using it in the future.  First impressions; it's a good start, but it requires some adjusting &amp; that is the reason for a 3 star rating.  Having grown up in Chicago I have sampled many of the local purveyors of Italian Beef &amp; have a pretty good idea of what an authentic sandwich should taste like.  Proper Italian beef is thin sliced, something most of us are unable to achieve at home &amp; that has a profound effect on the flavor profile.  By shredding the beef we get more of the beef flavor &amp; less of the spice flavor that makes the traditional sandwich so good.  I used the recommendations of the others &amp; used beef broth.  I'm thinking that next time I may use water instead to lessen the french dip flavor profile.  I would eliminate the bay leaf &amp; next time increase the other spices.  I like using minced garlic &amp; granulated garlic.  I may also eliminate the Good Seasons packet &amp; use Morton's Nature's Seasons mix.       The bottom line is that this recipe is a good basic one, but for my tastes needs to be tweaked to account for the differences in the cooking method &amp; serving style.  My advice is to have fun &amp; experiment.\n\nUpdate:  Two days after making this recipe I added about a tablespoon of Del Appe hot giardiniera &amp; a couple tablespoons of mild giardiniera, let the beef/gravy marinate overnight, &amp; then sampled the next day.  What a difference.  It was the flavor profile I was looking for.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>3
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"GerryC",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2005-05-20T07:11:29.857Z",
      "reviewBody"=>"Loved this had a great taste. I sauteed  bell peppers in olive oil with garlic. Served the meat on buns with mozzarella cheese and the peppers.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"MOLSON7",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2010-12-30T14:50:56.753Z",
      "reviewBody"=>"I made this for dinner last night and all my picky boys raved about this. I cooked exactly as instructed and it turned out fantastic. I made an au jus sauce out of the drippings, melted some cheese on top and dinner was done! Thanks for the wonderful recipe!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Beach Brat",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-10-25T10:49:55.223Z",
      "reviewBody"=>"The first day I made this, I thought it was just 'ok'. I cooked it on LOW for 9 hours...The next day it was 2x's as good...also, next time I think I will use 2 packets of seasoning, and not just 1.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>4
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"maryjane27",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2012-04-03T05:45:58.300Z",
      "reviewBody"=>"Excellent recipe!!!  Who needs Portillo's!!\n\nI did use the recommendation however to add 2 packs of the dressing mix as well as using Chuck.\nIt shredded so nicely.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"jan",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2014-08-11T03:43:15.887Z",
      "reviewBody"=>"This was Awesome. I made this for my family yesterday and they absolutely loveed it. I followed the recipe to the letter and came out perfect. My daughter wouldn't quit raving about them and my wife said good thing football season is coming up because these are on the menu for all the games. I will absolutely be making this again. I give it 5 stars only because there are no 10 star reviews.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"ousooner1",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-01-30T15:15:52.323Z",
      "reviewBody"=>"This was excellent!  Followed to the recipe except I omitted the bay leaf as I didnt have any on hand.  Super tender, wonderful on nice crusty rolls with sauteed onions and provolone cheese...will def make this again",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"NicsGTO",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2005-12-27T13:20:06.670Z",
      "reviewBody"=>"The easiest way to cook a roast and it comes out so tender, not chewy at all.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"SUNNYNIGHTS68",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2011-08-20T18:48:33.047Z",
      "reviewBody"=>"Whole family enjoyed these sandwiches tonight. Good flavor, and easy to make. I also added a couple of bouillon cubes to the water, therefore skipping the extra salt, and used onion powder instead of onion salt. I also used chuck eye roast instead of rump roast. For some reason, the chuck eye roasts available locally seem to shrink and give off tons of water, so next time, I will probably cut the liquid in the recipe down to 2 cups, and still use the 2 bouillon cubes. Just FYI, I used a 2.87# chuck eye roast, and it yielded 6 heaping sandwiches. We broiled provolone on a large French poppy seed roll, added sliced tomato and sauteed red onions and mushrooms to the beef and defatted drippings. It was quite good... I don't know how my husband ate 2. Served with a green salad and sauteed zucchini and yellow squash. Beautiful meal. Thank you for the recipe.. it's a nice change from bbq beef, cooked similarly.",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"Julieee",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2012-08-06T18:23:12.413Z",
      "reviewBody"=>"It was ok, but not as great as great as some of the other reviews suggested. Based on some of the other reviews, I was expecting a bigger flavor. I doubled the Italian dressing, as recommended. It was better once you took it out of the slow cooker, shredded it, sautéed it with onions and peppers, and then loaded it up like a cheesesteak. But still good - my husband liked it, and that says a lot. He's very picky!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>3
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"VAmommy",
        "image"=>nil,
        "sameAs"=>nil
      }
    },
    {
      "@type"=>"Review",
      "datePublished"=>"2007-05-08T14:09:58.297Z",
      "reviewBody"=>"I have been looking for an Italian Beef recipe for 4 years, that rivaled the sandwiches I used to eat when I lived in Chicago. I think this is it! This was EASY and so delicious!! Thank you, thank you!",
      "reviewRating"=>{
        "@type"=>"Rating",
        "worstRating"=>"1",
        "bestRating"=>"5",
        "ratingValue"=>5
      },
      "author"=>{
        "@type"=>"Person",
        "name"=>"TMRath",
        "image"=>nil,
        "sameAs"=>nil
      }
    }
  ],
  "video"=>{
    "@context"=>"http://schema.org",
    "@type"=>"VideoObject",
    "name"=>"Slow Cooker Italian Beef for Sandwiches",
    "description"=>"Make this great Italian beef for sandwiches in your slow cooker.",
    "uploadDate"=>"2012-05-09T00:35:32.450Z",
    "duration"=>"PT2M16.277S",
    "thumbnailUrl"=>"https://imagesvc.meredithcorp.io/v3/mm/image?url=https%3A%2F%2Fcf-images.us-east-1.prod.boltdns.net%2Fv1%2Fstatic%2F1033249144001%2F930c2eaa-4495-45cb-83ed-494c6100232b%2F09407e2a-04ec-46c1-846b-381856bed279%2F1280x720%2Fmatch%2Fimage.jpg",
    "publisher"=>{
      "@type"=>"Organization",
      "name"=>"Allrecipes",
      "url"=>"https://www.allrecipes.com",
      "logo"=>{
        "@type"=>"ImageObject",
        "url"=>"https://www.allrecipes.com/img/logo.png",
        "width"=>209,
        "height"=>60
      },
      "sameAs"=>[
        "https://www.facebook.com/allrecipes",
        "https://twitter.com/Allrecipes",
        "https://www.pinterest.com/allrecipes/",
        "https://www.instagram.com/allrecipes/"
      ]
    },
    "embedUrl"=>"https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1628833600001"
  }
}